load-test.yml
#Test1 LoadTest
#
config:
  target: 'http://localhost:3000/'
  phases:
    - duration: 60  # The test will run for 60 seconds
      arrivalRate: 10  # Simulate 10 users per second
    - duration: 120  # Then sustain this load for 120 seconds
      arrivalRate: 10  # Simulate 20 users per second

scenarios:
  - flow:
      - get:
          url: '/?route=login'  # Mimics a navigation to /login via query param
      - think: 5
      - get:
          url: '/?route=cart'  # Mimics navigation to /cart



#Test2 LoadTest
#config:
#  target: 'http://localhost:3000/'
#  phases:
#    - duration: 60
#      arrivalRate: 10  # 10 users per second for 60 seconds
#    - duration: 120
#      arrivalRate: 10  # Continue with 10 users per second
#    - duration: 30
#      arrivalRate: 100  # Spike: Simulate 100 users per second for 30 seconds
#    - duration: 60
#      arrivalRate: 10  # Drop back down to normal traffic
#
#scenarios:
#  - flow:
#      - get:
#          url: '/'  # Simulate user accessing the homepage
#      - think: 5  # Wait for 5 seconds before next action
#      - get:
#          url: '/?route=cart'  # Simulate user going to cart page
#      - think: 5
#      - get:
#          url: '/?route=forgot-password'  # Simulate a user visiting the profile page
#      - think: 5
#      - get:
#          url: '/?route=my-arts'  # Simulate a user visiting the profile page

#Test3 LoadTest
#config:
#  target: 'http://localhost:3000/'
#  phases:
#    - duration: 60
#      arrivalRate: 10  # 10 users per second
#    - duration: 60
#      arrivalRate: 20  # Increase to 20 users per second
#    - duration: 60
#      arrivalRate: 40  # Increase to 40 users per second
#    - duration: 60
#      arrivalRate: 80  # Increase to 80 users per second
#    - duration: 60
#      arrivalRate: 160  # Ramp up to 160 users per second
#
#scenarios:
#  - flow:
#      - get:
#          url: '/'
#      - think: 3
#      - get:
#          url: '/?route=register'
#      - think: 5
#      - get:
#          url: '/?route=cart'
#      - think: 5


#Test4 LoadTest

#config:
#  target: 'http://localhost:3000/'
#  phases:
#    - duration: 60
#      arrivalRate: 10
#
#scenarios:
#  - flow:
#      - get:
#          url: '/'  # User 1 accesses the homepage
#      - think: 2
#      - get:
#          url: '/?route=login'  # User 2 views the products page
#      - think: 3
#      - get:
#          url: '/?route=cart'  # User 3 views the cart page